Linux/LinuxKernel/AT&T汇编笔记.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>AT&amp;T汇编笔记</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="AT&amp;T汇编笔记"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-19 19:33:36 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="H" href="../../index.html#linuxkernel"> HOME </a>
</div>


<div id="content">
<h1 class="title">AT&amp;T汇编笔记</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>



<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 与x86差别</a></li>
<li><a href="#sec-2">2 嵌入汇编</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 与x86差别</h2>
<div class="outline-text-2" id="text-1">

<ol>
<li>寄存器前加%<br/>
</li>
<li>源和目的与x86相反<br/>
</li>
<li>立即数前面加\(，符号常数直接引用，引用符号地址前面加\)<br/>
</li>
<li>操作数长度b w l 分别表示8、16、32位。<br/>
   movw %ax, %bx 把16位长度的ax寄存器里mov到bx中<br/>
</li>
<li>跳转<br/>
<ul>
<li>远跳转，Intel为jmp far, call far，AT&amp;T是ljmp, lcall。<br/>
</li>
<li>远程返回指令：Intel为ret far，AT&amp;T为 lret。<br/>
</li>
<li>寻址方式：<br/>
     Intel: section: [base + index*scale + disp]<br/>
     AT&amp;T: section: disp(base, index, scale)<br/>
</li>
</ul>

</li>
</ol>


<p><br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 嵌入汇编</h2>
<div class="outline-text-2" id="text-2">


<p><br/>
<pre class="example">格式：_asm_("asm statements": output: inputs: registers_modified)
"a" "b" "c" "d" 分别表示 eax, ebx, ecx, edx
"S" "D" 表示 esi, edi
"r" 表示任何寄存器
0 表示与上面位置相同的同一寄存器
</pre>

<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>
</div>
</div>

</body>
</html>
